Revit 2017 API
RebarConstrainedHandle Methods
The RebarConstrainedHandle type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetEdgeNumber
 If the RebarConstrainedHandle's RebarHandleType is 'Edge,' then this function will return the number of the edge that is driven by the handle.
GetHandleType
 Returns the RebarHandleType of a RebarConstrainedHandle.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEdgeHandle
 Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge.'
IsValid
 Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace